// Includes --------------------------------------------------------------------
#include "timer.h"

// Private Typedef -------------------------------------------------------------

// Private Macro ---------------------------------------------------------------

// Private Variables -----------------------------------------------------------
uint8_t timerCnt = 0;
uint8_t timerOcr = 0xFF;

// Private Function prototypes -------------------------------------------------

// Functions -------------------------------------------------------------------
/*******************************************************************************
Функция инициализации программного таймера в режиме CTC, TOP = ocr = 0xFF
Источник тактового сигнала - переполнение таймера Т0
Время переполнения:
t = ocr * 2.048 мс; f = 1 / ocr / 2.048 Гц
*******************************************************************************/
void TimerInit(void)
{
    timerCnt = 0;
    timerOcr = 0xFF;
}

void TimerInc(void)
{
    timerCnt++;
    if (timerCnt >= timerOcr)
    {
        timerCnt = 0;
        TimerComp();
    }    
}
// End File --------------------------------------------------------------------