// Includes --------------------------------------------------------------------
#include "pcf8583.h"

// Macro -----------------------------------------------------------------------
#define PCF_SLAW 0xA0  // Адресный байт для записи часов реального времени PCF8583

// Регистры часов реального времени PCF8583
#define PCF_CS    0x00  // Регистр управления и статуса
#define PCF_HSEC  0x01  // Регистр сотых секунд
#define PCF_SEC   0x02  // Регистр секунд
#define PCF_MIN   0x03  // Регистр минут
#define PCF_HOURS 0x04  // Регистр часов

Time_t TimeInit = {
    0,             // Секунды
    (3 << 4) + 0,  // Минуты
    9,             // Часы
    (2 << 4) + 5,  // Дни 1-30/31
    1,             // Год 0-3
    5,             // Месяц 1-12
    1,             // День недели 0-6
};

// Functions -------------------------------------------------------------------
void PcfInit()
{
    TwiWrite(PCF_SLAW, PCF_SEC, (uint8_t*)&TimeInit, sizeof(TimeInit));
}
/*******************************************************************************
Функция чтения времени из часов реального времени PCF8583

Аргументы:
ptime       указатель на структуру, в которую будет записано время
*******************************************************************************/
void PcfReadTime(Time_t* ptime)
{
    TwiRead(PCF_SLAW, PCF_SEC, (uint8_t*)ptime, sizeof(*ptime));
}

// End File --------------------------------------------------------------------