// Includes --------------------------------------------------------------------
#include <avr/io.h>         // Заголовочный файл для работы с РВВ МК
#include <avr/interrupt.h>  // Заголовочный файл для работы с прерываниями МК

#include "main.h"
#include "twi.h"  // Заголовочный файл для работы с модулем TWI МК

// Handlers --------------------------------------------------------------------
/*******************************************************************************
Two-wire Serial Interface Handler
*******************************************************************************/
ISR(TWI_vect)
{
    // Обработка события на шине i2c
    // Если установлен флаг завершения чтения модуля TWI rxc, то
    // устанавливаем флаг завершения считывания времени timeRxc
    TwiFlags_t twiFlags = TwiTwsi();
    if (twiFlags.rxc)
    {
        flag.timeRxc = 1;
    }
}
// End File --------------------------------------------------------------------