#ifndef __ONEWIRE_H
#define __ONEWIRE_H

// Includes -------------------------------------------------------------------------------
#include <avr/io.h>      // Заголовочный файл для работы с РВВ МК
#include <util/delay.h>  // Заголовочный файл для работы с задержками

// Typedef ---------------------------------------------------------------------

// Macro -----------------------------------------------------------------------

// Variables -------------------------------------------------------------------

// Function prototypes ---------------------------------------------------------
void    OnewireInit(void);
uint8_t OnewireReset(void);
void    OnewireSend(uint8_t data);
uint8_t OnewireRead(void);
// Inline Functions ------------------------------------------------------------

#endif

// End File --------------------------------------------------------------------