// Includes --------------------------------------------------------------------
#include "timer.h"

// Variables -------------------------------------------------------------------
uint8_t timerCnt = 0;     // Счетчик программного таймера
uint8_t timerOcr = 0xFF;  // Значение в блоке сравнения програмного таймера

// Functions -------------------------------------------------------------------
/*******************************************************************************
Функция инициализации программного таймера
Режим: CTC; TOP = timerOcr
Источник тактового сигнала - переполнение таймера Т0
Время переполнения:
t = timerOcr * 2.048 мс; f = 1 / timerOcr / 2.048 Гц

Аргументы:
ocr:    значение в блоке сравнения программного таймера
*******************************************************************************/
void TimerInit(uint8_t ocr)
{
    timerCnt = 0;
    timerOcr = ocr;
}

/*******************************************************************************
Функция инкремента программного таймера в режиме CTC
При переполнении вызывается функция TimerComp()
*******************************************************************************/
void TimerInc(void)
{
    timerCnt++;
    if (timerCnt >= timerOcr)
    {
        timerCnt = 0;
        TimerComp();
    }
}
// End File --------------------------------------------------------------------