#ifndef __TIMER_H
#define __TIMER_H

// Includes --------------------------------------------------------------------
#include <avr/io.h>  // Заголовочный файл для работы с РВВ МК

// Variables -------------------------------------------------------------------
extern uint8_t timerOcr;  // Значение в блоке сравнения програмного таймера

// Function prototypes ---------------------------------------------------------
void TimerInit(uint8_t ocr);
void TimerInc(void);
void TimerComp(void);

#endif
// End File --------------------------------------------------------------------