// Includes --------------------------------------------------------------------
#include "pcf8583.h"

// Macro -----------------------------------------------------------------------
#define PCF_SLAW 0xA0  // Адресный байт для записи часов реального времени PCF8583

// Регистры часов реального времени PCF8583
#define PCF_CS    0x00  // Регистр управления и статуса
#define PCF_HSEC  0x01  // Регистр сотых секунд
#define PCF_SEC   0x02  // Регистр секунд
#define PCF_MIN   0x03  // Регистр минут
#define PCF_HOURS 0x04  // Регистр часов

// Functions -------------------------------------------------------------------
/*******************************************************************************
Функция чтения времени из часов часов реального времени PCF8583

Арументы:
ptime       указатель на структуру в которую будет записано время
*******************************************************************************/
void PcfReadTime(Time_t* ptime)
{
    TwiRead(PCF_SLAW, PCF_SEC, (uint8_t*)ptime, sizeof(*ptime));
}

// End File --------------------------------------------------------------------