#ifndef __PCF8583_H
#define __PCF8583_H

// Includes --------------------------------------------------------------------
#include "twi.h"  // Заголовочный файл для работы с модулем TWI МК

// Typedef ---------------------------------------------------------------------
// Тип времени
typedef struct
{
    uint8_t seconds;  // Секунды
    uint8_t minutes;  // Минуты
} Time_t;

// Function prototypes ---------------------------------------------------------
void PcfReadTime(Time_t* time);

#endif
// End File --------------------------------------------------------------------