#ifndef __MAIN_H
#define __MAIN_H

// Includes --------------------------------------------------------------------
#include "settings.h"
#include <avr/io.h>      // Заголовочный файл для работы с РВВ МК
#include <avr/sleep.h>   // Заголовочный файл для работы со спящим режимом
#include <util/delay.h>  // Заголовочный файл для работы с задержками

#include "semseg.h"  // Заголовочный файл для работы с семисегментными
                     // индикаторами
#endif
// End File --------------------------------------------------------------------