#ifndef __MAIN_H
#define __MAIN_H

// Includes --------------------------------------------------------------------
#include <avr/io.h>         // Заголовочный файл для работы с РВВ МК
#include <avr/interrupt.h>  // Заголовочный файл для работы с прерываниями МК

// Typedef ---------------------------------------------------------------------

// Variables -------------------------------------------------------------------

void Time(){};
void TimeShow(){};
void TimeSet(){};
void Temp(){};
void TempShow(){};

static inline void None(void)
{
}

#endif
// End File --------------------------------------------------------------------